Repository: BaanCraft/beeware
Catalog: docs/locales/*/LC_MESSAGES/tutorial/topics/camera-access.po
Languages: de

source: Using the camera
de: Kameranutzung

source: Almost every modern computing device has a camera of some sort. In this tutorial, we'll write new application that is able to request access to this camera, take a photograph, and then display that photograph in the app. new application that uses your device's camera.
de: Fast jedes moderne Computergerät verfügt über eine Kamera. In diesem Tutorial schreiben wir eine neue Anwendung, die Zugriff auf diese Kamera anfordern, ein Foto aufnehmen und dieses Foto dann in der App anzeigen kann. Neue Anwendung, die die Kamera Ihres Geräts verwendet.

source: This tutorial won't work on all platforms!
de: Dieses Tutorial funktioniert nicht auf allen Plattformen!

source: Unfortunately, at present, this tutorial will only work on macOS and Android.
de: Leider funktioniert dieses Tutorial derzeit nur auf macOS und Android.

source: Although iPhones all have cameras, the iOS *Simulator* doesn't have a working camera. Windows and Linux devices also have cameras, but Toga doesn't currently have the ability to access the camera on these platforms.
de: Obwohl alle iPhones über Kameras verfügen, verfügt der iOS-*Simulator* nicht über eine funktionierende Kamera. Windows- und Linux-Geräte verfügen ebenfalls über Kameras, aber Toga kann derzeit auf diesen Plattformen nicht auf die Kamera zugreifen.

source: The code presented here will *run* on Windows or Linux; but it will raise an error when you try to take a photograph.
de: Der hier dargestellte Code *läuft* unter Windows oder Linux, löst jedoch einen Fehler aus, wenn Sie versuchen, ein Foto aufzunehmen.

source: The code will work if it is run on an actual iOS device, but will fail to take a photograph if deployed to the iOS simulator.
de: Der Code funktioniert, wenn er auf einem echten iOS-Gerät ausgeführt wird, kann jedoch kein Foto aufnehmen, wenn er im iOS-Simulator bereitgestellt wird.

source: Start a new project
de: Neues Projekt starten

source: For this tutorial, we're not going to build onto the application from the core tutorial - we're going to start a fresh project. You can use the same virtual environment you used in the first project; but we need to re-run the ``briefcase new`` wizard.
de: Für dieses Tutorial werden wir nicht auf der Anwendung aus dem Kerntutorial aufbauen, sondern ein neues Projekt beginnen. Sie können dieselbe virtuelle Umgebung verwenden, die Sie im ersten Projekt verwendet haben. Wir müssen jedoch den Assistenten „Aktenkoffer neu“ erneut ausführen.

source: Change back to the directory that contains the ``helloworld`` project folder, and start a new project named "Hello Camera":
de: Wechseln Sie zurück in das Verzeichnis, das den Projektordner ``helloworld`` enthält, und starten Sie ein neues Projekt mit dem Namen „Hello Camera“:

source: Add code to take a photo
de: Fügen Sie Code hinzu, um ein Foto aufzunehmen

source: The wizard has generated a new empty Toga project. We can now add the code to take and display a photograph. Edit the ``app.py`` for the new application so that it has the following content:
de: Der Assistent hat ein neues leeres Toga-Projekt generiert. Wir können jetzt den Code zum Aufnehmen und Anzeigen eines Fotos hinzufügen. Bearbeiten Sie die Datei ``app.py`` für die neue Anwendung, sodass sie den folgenden Inhalt hat:

source: This code has two changes over the default app that is generated by Briefcase. These additions are highlighted in yellow:
de: Dieser Code weist gegenüber der von Briefcase generierten Standard-App zwei Änderungen auf. Diese Ergänzungen sind gelb hervorgehoben:

source: The first highlighted code block (in the ``startup()`` method) adds the two widgets needed to control the camera: an ``ImageView`` to display a photo; and a ``Button`` to trigger the camera.
de: Der erste hervorgehobene Codeblock (in der Methode ``startup()``) fügt die beiden Widgets hinzu, die zur Steuerung der Kamera erforderlich sind: ein ``ImageView`` zum Anzeigen eines Fotos und einen ``Button`` zum Auslösen der Kamera.

source: The second highlighted code block (the ``take_photo()`` method) defines the event handler when the button is pressed. This handler first confirms if the application has permission to take a photo; if permission doesn't exist, it is requested. Then, a photo is taken. The request for permission and the request to take a photo are both asynchronous requests, so they require the use of ``await``; while the app is waiting for the user to confirm permissions or take the photo, the app's event loop can continue in the background.
de: Der zweite hervorgehobene Codeblock (die Methode ``take_photo()``) definiert den Ereignishandler, wenn die Schaltfläche gedrückt wird. Dieser Handler bestätigt zunächst, ob die Anwendung die Berechtigung zum Aufnehmen eines Fotos hat. Wenn keine Berechtigung vorliegt, wird sie angefordert. Dann wird ein Foto aufgenommen. Die Anforderung der Berechtigung und die Anforderung zum Aufnehmen eines Fotos sind beide asynchrone Anforderungen, sodass die Verwendung von ``await`` erforderlich ist. Während die App darauf wartet, dass der Benutzer die Berechtigung bestätigt oder das Foto aufnimmt, kann die Ereignisschleife der App im Hintergrund fortgesetzt werden.

source: If the camera successfully takes a photo, it will return an ``Image`` object that can be assigned as the content of the ``ImageView``. If the photo request was canceled by the user, the ``self.camera.take_photo()`` call will return ``None``, and the result can be ignored. If the user doesn't grant permission to use the camera, or the camera isn't implemented on the current platform, an error will be raised, and a dialog will be shown to the user.
de: Wenn die Kamera erfolgreich ein Foto aufnimmt, gibt sie ein „Image“-Objekt zurück, das als Inhalt der ``ImageView`` zugewiesen werden kann. Wenn die Fotoanforderung vom Benutzer abgebrochen wurde, gibt der Aufruf ``self.camera.take_photo()`` ``None`` zurück und das Ergebnis kann ignoriert werden. Wenn der Benutzer keine Berechtigung zur Verwendung der Kamera erteilt oder die Kamera auf der aktuellen Plattform nicht implementiert ist, wird ein Fehler ausgelöst und dem Benutzer ein Dialogfeld angezeigt.

source: Adding device permissions
de: Geräteberechtigungen hinzufügen

source: Part of this code we've just added asks for permission to use the camera. This is a common feature of modern app platforms - you can't access hardware features without explicitly asking the user's permission first.
de: Ein Teil des Codes, den wir gerade hinzugefügt haben, fragt nach der Erlaubnis, die Kamera zu verwenden. Dies ist eine gängige Funktion moderner App-Plattformen – Sie können nicht auf Hardwarefunktionen zugreifen, ohne vorher ausdrücklich die Erlaubnis des Benutzers einzuholen.

source: However, this request comes in two parts. The first is in the code we've just seen; but before the app can ask for permissions, it needs to declare the permissions it is going to ask for.
de: Diese Anfrage besteht aus zwei Teilen. Der erste Teil befindet sich im Code, den wir gerade gesehen haben. Bevor die App jedoch Berechtigungen anfordern kann, muss sie die Berechtigungen deklarieren, die sie anfordern wird.

source: The permissions required by each platform are slightly different, but Briefcase has a cross-platform representation for many common hardware permissions. In the ``[tool.briefcase.app.helloworld]`` configuration section of your app's ``pyproject.toml`` file, add the following (just above the ``sources`` declaration):
de: Die für jede Plattform erforderlichen Berechtigungen unterscheiden sich geringfügig, aber Briefcase bietet eine plattformübergreifende Darstellung für viele gängige Hardwareberechtigungen. Fügen Sie im Konfigurationsabschnitt ``[tool.briefcase.app.helloworld]`` der Datei ``pyproject.toml`` Ihrer App Folgendes hinzu (direkt über der Deklaration ``Sources``):

source: This declares that your app needs to access the camera, and provides a short description why the camera is required. This description is needed on some platforms (most notably macOS and iOS) and will be displayed to the user as a additional information when the permission dialog is presented.
de: Dies erklärt, dass Ihre App auf die Kamera zugreifen muss, und liefert eine kurze Beschreibung, warum die Kamera erforderlich ist. Diese Beschreibung ist auf einigen Plattformen erforderlich (insbesondere macOS und iOS) und wird dem Benutzer als zusätzliche Information angezeigt, wenn der Berechtigungsdialog angezeigt wird.

source: We can now generate and run the app:
de: Wir können jetzt die App generieren und ausführen:

source: When the app runs, you'll be presented with a button. Press the button, and the platform's default camera dialog will be displayed. Take a photo; the camera dialog will disappear, and the photo will be displayed on in the app, just above the button. You could then take another photo; this will replace the first photo.
de: Wenn die App ausgeführt wird, wird Ihnen eine Schaltfläche angezeigt. Drücken Sie die Schaltfläche, und der Standardkameradialog der Plattform wird angezeigt. Machen Sie ein Foto. Der Kameradialog verschwindet und das Foto wird in der App direkt über der Schaltfläche angezeigt. Sie können dann ein weiteres Foto machen. Dadurch wird das erste Foto ersetzt.

source: Adding more permissions
de: Weitere Berechtigungen hinzufügen

source: Permissions are declared in the files that are generated during the original call to ``briefcase create``. Unfortunately, Briefcase can't update these files once they've been initially generated; so if you want to add a new permission to your app, or modify existing permissions, you'll need to re-create the app. You can do this by re-running ``briefcase create``; this will warn you that the existing app will be overwritten, and then regenerate the application with the new permissions.
de: Berechtigungen werden in den Dateien deklariert, die während des ursprünglichen Aufrufs von ``briefcase create`` generiert werden. Leider kann Briefcase diese Dateien nicht aktualisieren, nachdem sie einmal generiert wurden. Wenn Sie Ihrer App also eine neue Berechtigung hinzufügen oder vorhandene Berechtigungen ändern möchten, müssen Sie die App neu erstellen. Sie können dies tun, indem Sie ``briefcase create`` erneut ausführen. Dadurch werden Sie gewarnt, dass die vorhandene App überschrieben wird, und die Anwendung wird dann mit den neuen Berechtigungen neu generiert.
